package com.sto_opka91.militarydirectory

val KAT_LIST = listOf("1 категория","2 категория","3 категория")
val LESSON_1_LIST = listOf("Упр 17 Бег на 60 м", "Упр 18 Бег на 100 м", "Упр 19 Челночный бег 10×10 м",
    "Упр 20 Плавание на 50 м вольным стилем", "Упр 21 Плавание на 100 м вольным стилем",
    "Упр 22 Плавание на 100 м способом брасс", "Упр 30 Комплексное упражнение на ловкость",
    "Упр 31 Прыжки со скакалкой", "Упр 32 Передвижение по узкой опоре (бревну)",
    "Упр 33 Комбинированное упражнение на брусьях", "Упр 34 Комбинированное упражнение на перекладине",
    "Упр 35 Упражнения в опорных прыжках", "Упр 36 Контрольное упражнение с баскетбольным мячом",
    "Упр 37 Контрольное упражнение с мини-футбольным мячом", "Упр 38 Контрольное упражнение с волейбольным мячом")
val LESSON_2_LIST = listOf("Упр 1 Сгибание и разгибание рук в упоре лежа", "Упр 2 Наклон туловища вперед",
    "Упр 3 Подтягивание на перекладине", "Упр 4 Поднимание ног к перекладине",
    "Упр 5 Подъем переворотом на перекладине", "Упр 6 Подъем силой на перекладине",
    "Упр 7 Комбинированное силовое упражнение на перекладине", "Упр 8 Сгибание и разгибание рук в упоре на брусьях",
    "Упр 9 Угол в упоре на брусьях", "Упр 10 Рывок гири",
    "Упр 11 Толчок двух гирь", "Упр 12 Толчок двух гирь по длинному циклу",
    "Упр 13 Комплексное упражнение", "Упр 14 Жим штанги лежа",
    "Упр 15 Становая тяга со штангой", "Упр 16 Приседание со штангой")
val LESSON_3_LIST = listOf("Упр 23 Бег на 400 м", "Упр 24 Бег на 1 км",
    "Упр 25 Бег на 3 км", "Упр 26 Бег на 5 км",
    "Упр 27 Лыжная гонка на 5 км", "Упр 28 Плавание на 500 м вольным стилем",
    "Упр 29 Восхождение на платформу (тумбу)")
val LESSON_4_LIST = listOf("Упр 39 Бег на 60 м с грузом", "Упр 40 Бег на 60 м в экипировке с автоматом",
    "Упр 41 Челночный бег 4×100 м с оружием", "Упр 42 Бег на 800 м с оружием", "Упр 43 Марш-бросок на 5 км",
"Упр 44 Марш-бросок на лыжах на 5 км", "Упр 45 Общее контрольное упражнение на единой полосе препятствий",
"Упр 46 Специальное контрольное упражнение для курсантов военно-учебных заведений, готовящих специалистов для подразделений и воинских частей Сухопутных войск (кроме танковых, зенитных ракетных, инженерных и самоходных артиллерийских воинских частей, танковых подразделений мотострелковых воинских частей), морской пехоты",
"Упр 47 Специальное контрольное упражнение для курсантов военно-учебных заведений, готовящих специалистов для танковых, зенитных ракетных, ракетных, инженерных и самоходных артиллерийских воинских частей, танковых подразделений мотострелковых воинских частей",
"Упр 48 Специальное контрольное упражнение для военнослужащих Воздушно-десантных войск",
"Упр 49 Специальное контрольное упражнение для военнослужащих наводных кораблей и подводных лодок, курсантов военно-учебных заведений (учебных воинских частей), готовящих специалистов для надводных кораблей и подводных лодок",
"Упр 50 Специальное контрольное упражнение для военнослужащих горных подразделений, Упр 51 Общее контрольное упражнение на специальной полосе препятствий для военнослужащих",
"Упр 52 Общее контрольное упражнение на специальной морской полосе препятствий для военнослужащих",
    "Упр 53 Комплекс приемов и действий рукопашного боя", "Упр 54 Метание ножа на точность с места",
    "Упр 55 Метание малой пехотной лопаты на точность с места", "Упр 56 Плавание в обмундировании с оружием на 50 м",
    "Упр 57 Плавание в обмундировании с оружием на 100 м", "Упр 58 Ныряние в длину в форме",
    "Упр 59 Бег на 3 км со стрельбой и метанием гранат", "Упр 60 Бег с преодолением полосы препятствий",
    "Упр 61 Комплексное упражнение «Квадрат»", "Упр 62 Упражнение на стационарном гимнастическом колесе",
    "Упр 63 Упражнение на подвижном гимнастическом колесе", "Упр 64 Упражнение на лопинге",
    "Упр 65 Упражнение на батуте", "Упр 66 Поднимание ящика для боеприпасов", "Упр 67 Упор лежа на предплечьях",
    "Упр 68 Метание гранаты на дальность с места", "Упр 69 Метание гранат на точность", "Упр 70 Вис на перекладине")
val GENRE_LIST = listOf("мужской", "женский")
val LIST_RESULT_DECIMAL = listOf("Упр 1 Сгибание и разгибание рук в упоре лежа", "Упр 2 Наклон туловища вперед",
    "Упр 3 Подтягивание на перекладине", "Упр 4 Поднимание ног к перекладине",
    "Упр 5 Подъем переворотом на перекладине", "Упр 6 Подъем силой на перекладине",
    "Упр 7 Комбинированное силовое упражнение на перекладине", "Упр 8 Сгибание и разгибание рук в упоре на брусьях",
    "Упр 9 Угол в упоре на брусьях", "Упр 10 Рывок гири",
    "Упр 11 Толчок двух гирь", "Упр 12 Толчок двух гирь по длинному циклу",
    "Упр 13 Комплексное упражнение", "Упр 14 Жим штанги лежа",
    "Упр 15 Становая тяга со штангой", "Упр 16 Приседание со штангой","Упр 17 Бег на 60 м",
    "Упр 18 Бег на 100 м", "Упр 19 Челночный бег 10×10 м",
    "Упр 20 Плавание на 50 м вольным стилем","Упр 29 Восхождение на платформу (тумбу)",
    "Упр 30 Комплексное упражнение на ловкость",
    "Упр 31 Прыжки со скакалкой", "Упр 32 Передвижение по узкой опоре (бревну)",
    "Упр 33 Комбинированное упражнение на брусьях", "Упр 34 Комбинированное упражнение на перекладине",
    "Упр 35 Упражнения в опорных прыжках", "Упр 36 Контрольное упражнение с баскетбольным мячом",
    "Упр 37 Контрольное упражнение с мини-футбольным мячом", "Упр 38 Контрольное упражнение с волейбольным мячом",
    "Упр 39 Бег на 60 м с грузом", "Упр 40 Бег на 60 м в экипировке с автоматом",
    "Упр 53 Комплекс приемов и действий рукопашного боя", "Упр 54 Метание ножа на точность с места",
    "Упр 55 Метание малой пехотной лопаты на точность с места","Упр 58 Ныряние в длину в форме",
    "Упр 62 Упражнение на стационарном гимнастическом колесе", "Упр 63 Упражнение на подвижном гимнастическом колесе",
    "Упр 65 Упражнение на батуте", "Упр 66 Поднимание ящика для боеприпасов",
    "Упр 68 Метание гранаты на дальность с места", "Упр 69 Метание гранат на точность")
val LIST_RESULT_WEIGHT = listOf("Упр 10 Рывок гири",
    "Упр 11 Толчок двух гирь", "Упр 12 Толчок двух гирь по длинному циклу",
    "Упр 14 Жим штанги лежа",
    "Упр 15 Становая тяга со штангой", "Упр 16 Приседание со штангой")

val LESSON_1_VT4_LIST = listOf("Бег в форме 100 м", "Бег в форме 60 м")
val LESSON_2_VT4_LIST = listOf("Подтягивание", "Подъем переворотом")
val LESSON_3_VT4_LIST = listOf("Бег в форме 1 км", "Бег в форме 3 км")
val DESCRIBE_RESULT_FP2023_LIST = listOf("Высший уровень. Ты просто космос", "Первый уровень. Отличная сдача",
    "Второй уровень. Неплохая сдача", "Пятёрочка. Сдача норм, но надо же денюжку получать",
    "Четверочка. Старайся больше", "Троечка. Ты на грани", "Двойка. Пора идти к Начфизу и договариваться", "Двойка. Не уложился в порог. Беда!")
val DESCRIBE_RESULT_VT4 = listOf("КМС. Красавчик", "I разряд. 80% твои", "II разряд. Красавчик, но надо лучше", "III разряд. Надо готовиться", "Все плохо, но, братишка, не расстраивайся")
val LIST_KURS = listOf("1 курс", "2 курс", "3 курс и старше")